# add repository
#tap 'caskroom/cask'

# Packages
# basic
brew 'coreutils'
brew 'curl'

# main shell & tools
brew 'fish'
brew 'tmux'
brew 'vim', args: ['with-override-system-vi']

# essential
brew 'ack'                        # grep successor
brew 'ag'                         # ack successor
brew 'pv'                         # pipe meter
brew 'ncdu'                       # disk usage
brew 'xz'                         # compression
brew 'tree'                       # tree generator
brew 'jq'                         # JSON processor
brew 'multitail'                  # tail hype
brew 'ranger'                     # file manager
brew 'pigz'                       # parallel gzip
brew 'ssh-copy-id'

# development
brew 'git'
brew 'tig'                        # git cli browser
brew 'gist'                       # snippets
brew 'gh'                         # git+hub wrapper
#brew 'bfg'                       # git repo cleaner
#brew 'gibo'                      # gitignore boilerplates

# network
brew 'curl'                       # newest cURL
brew 'wget'
brew 'nmap'                       # security scanner
brew 'mtr'                        # better traceroute
brew 'aria2'                      # download utility
brew 'swaks'                      # SMTP tester
brew 'spoof-mac'                  # MAC addres spoofing
brew 'knock'                      # port knocking
brew 'socat'
brew 'ngrep'
brew 'speedtest_cli'              # speedtest

# security & encryption
brew 'apg'                        # password generator
brew 'pass'                       # password manager
brew 'john'                       # cracker
brew 'sqlmap'                     # sql injection tool
brew 'hydra'                      # remote pass cracker
#brew 'gnupg2'                    # OpenPGP -- deprecated
#brew 'keybase'                   # Key repository

# osx specific
brew 'm-cli'                      # Swiss Army Knife for macOS
brew 'mas'                        # Mac App Store CLI
brew 'terminal-notifier'                    

# sysop tools
brew 'ansible'                    # server orchestrating

# other
brew 'jrnl'                       # shell notes

# node.js
brew 'node'

# DMG Apps - TODO

# GPGTools

